Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/atdf/PIC32MZ2025DAB176.atdf
         <register caption="" name="GLCDCURDATA57" offset="0x8E4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1415" />
            <bitfield mask="0x000000F0" name="PIXEL1414" />
            <bitfield mask="0x00000F00" name="PIXEL1413" />
            <bitfield mask="0x0000F000" name="PIXEL1412" />
            <bitfield mask="0x000F0000" name="PIXEL1411" />
            <bitfield mask="0x00F00000" name="PIXEL1410" />
            <bitfield mask="0x0F000000" name="PIXEL149" />
            <bitfield mask="0xF0000000" name="PIXEL148" />
         </register>
         <register caption="" name="GLCDCURDATA58" offset="0x8E8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1423" />
            <bitfield mask="0x000000F0" name="PIXEL1422" />
            <bitfield mask="0x00000F00" name="PIXEL1421" />
            <bitfield mask="0x0000F000" name="PIXEL1420" />
            <bitfield mask="0x000F0000" name="PIXEL1419" />
            <bitfield mask="0x00F00000" name="PIXEL1418" />
            <bitfield mask="0x0F000000" name="PIXEL1417" />
            <bitfield mask="0xF0000000" name="PIXEL1416" />
         </register>
         <register caption="" name="GLCDCURDATA59" offset="0x8EC" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1431" />
            <bitfield mask="0x000000F0" name="PIXEL1430" />
            <bitfield mask="0x00000F00" name="PIXEL1429" />
            <bitfield mask="0x0000F000" name="PIXEL1428" />
            <bitfield mask="0x000F0000" name="PIXEL1427" />
            <bitfield mask="0x00F00000" name="PIXEL1426" />
            <bitfield mask="0x0F000000" name="PIXEL1425" />
            <bitfield mask="0xF0000000" name="PIXEL1424" />
         </register>
         <register caption="" name="GLCDCURDATA60" offset="0x8F0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL157" />
            <bitfield mask="0x000000F0" name="PIXEL156" />
            <bitfield mask="0x00000F00" name="PIXEL155" />
            <bitfield mask="0x0000F000" name="PIXEL154" />
            <bitfield mask="0x000F0000" name="PIXEL153" />
            <bitfield mask="0x00F00000" name="PIXEL152" />
            <bitfield mask="0x0F000000" name="PIXEL151" />
            <bitfield mask="0xF0000000" name="PIXEL150" />
         </register>
         <register caption="" name="GLCDCURDATA61" offset="0x8F4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1515" />
            <bitfield mask="0x000000F0" name="PIXEL1514" />
            <bitfield mask="0x00000F00" name="PIXEL1513" />
            <bitfield mask="0x0000F000" name="PIXEL1512" />
            <bitfield mask="0x000F0000" name="PIXEL1511" />
            <bitfield mask="0x00F00000" name="PIXEL1510" />
            <bitfield mask="0x0F000000" name="PIXEL159" />
            <bitfield mask="0xF0000000" name="PIXEL158" />
         </register>
         <register caption="" name="GLCDCURDATA62" offset="0x8F8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1523" />
            <bitfield mask="0x000000F0" name="PIXEL1522" />
            <bitfield mask="0x00000F00" name="PIXEL1521" />
            <bitfield mask="0x0000F000" name="PIXEL1520" />
            <bitfield mask="0x000F0000" name="PIXEL1519" />
            <bitfield mask="0x00F00000" name="PIXEL1518" />
            <bitfield mask="0x0F000000" name="PIXEL1517" />
            <bitfield mask="0xF0000000" name="PIXEL1516" />
         </register>
         <register caption="" name="GLCDCURDATA63" offset="0x8FC" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1531" />
            <bitfield mask="0x000000F0" name="PIXEL1530" />
            <bitfield mask="0x00000F00" name="PIXEL1529" />
            <bitfield mask="0x0000F000" name="PIXEL1528" />
            <bitfield mask="0x000F0000" name="PIXEL1527" />
            <bitfield mask="0x00F00000" name="PIXEL1526" />
            <bitfield mask="0x0F000000" name="PIXEL1525" />
            <bitfield mask="0xF0000000" name="PIXEL1524" />
         </register>
         <register caption="" name="GLCDCURDATA64" offset="0x900" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL167" />
            <bitfield mask="0x000000F0" name="PIXEL166" />
            <bitfield mask="0x00000F00" name="PIXEL165" />
            <bitfield mask="0x0000F000" name="PIXEL164" />
            <bitfield mask="0x000F0000" name="PIXEL163" />
            <bitfield mask="0x00F00000" name="PIXEL162" />
            <bitfield mask="0x0F000000" name="PIXEL161" />
            <bitfield mask="0xF0000000" name="PIXEL160" />
         </register>
         <register caption="" name="GLCDCURDATA65" offset="0x904" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1615" />
            <bitfield mask="0x000000F0" name="PIXEL1614" />
            <bitfield mask="0x00000F00" name="PIXEL1613" />
            <bitfield mask="0x0000F000" name="PIXEL1612" />
            <bitfield mask="0x000F0000" name="PIXEL1611" />
            <bitfield mask="0x00F00000" name="PIXEL1610" />
            <bitfield mask="0x0F000000" name="PIXEL169" />
            <bitfield mask="0xF0000000" name="PIXEL168" />
         </register>
         <register caption="" name="GLCDCURDATA66" offset="0x908" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1623" />
            <bitfield mask="0x000000F0" name="PIXEL1622" />
            <bitfield mask="0x00000F00" name="PIXEL1621" />
            <bitfield mask="0x0000F000" name="PIXEL1620" />
            <bitfield mask="0x000F0000" name="PIXEL1619" />
            <bitfield mask="0x00F00000" name="PIXEL1618" />
            <bitfield mask="0x0F000000" name="PIXEL1617" />
            <bitfield mask="0xF0000000" name="PIXEL1616" />
         </register>
         <register caption="" name="GLCDCURDATA67" offset="0x90C" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1631" />
            <bitfield mask="0x000000F0" name="PIXEL1630" />
            <bitfield mask="0x00000F00" name="PIXEL1629" />
            <bitfield mask="0x0000F000" name="PIXEL1628" />
            <bitfield mask="0x000F0000" name="PIXEL1627" />
            <bitfield mask="0x00F00000" name="PIXEL1626" />
            <bitfield mask="0x0F000000" name="PIXEL1625" />
            <bitfield mask="0xF0000000" name="PIXEL1624" />
         </register>
         <register caption="" name="GLCDCURDATA68" offset="0x910" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL177" />
            <bitfield mask="0x000000F0" name="PIXEL176" />
            <bitfield mask="0x00000F00" name="PIXEL175" />
            <bitfield mask="0x0000F000" name="PIXEL174" />
            <bitfield mask="0x000F0000" name="PIXEL173" />
            <bitfield mask="0x00F00000" name="PIXEL172" />
            <bitfield mask="0x0F000000" name="PIXEL171" />
            <bitfield mask="0xF0000000" name="PIXEL170" />
         </register>
         <register caption="" name="GLCDCURDATA69" offset="0x914" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1715" />
            <bitfield mask="0x000000F0" name="PIXEL1714" />
            <bitfield mask="0x00000F00" name="PIXEL1713" />
            <bitfield mask="0x0000F000" name="PIXEL1712" />
            <bitfield mask="0x000F0000" name="PIXEL1711" />
            <bitfield mask="0x00F00000" name="PIXEL1710" />
            <bitfield mask="0x0F000000" name="PIXEL179" />
            <bitfield mask="0xF0000000" name="PIXEL178" />
         </register>
         <register caption="" name="GLCDCURDATA70" offset="0x918" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1723" />
            <bitfield mask="0x000000F0" name="PIXEL1722" />
            <bitfield mask="0x00000F00" name="PIXEL1721" />
            <bitfield mask="0x0000F000" name="PIXEL1720" />
            <bitfield mask="0x000F0000" name="PIXEL1719" />
            <bitfield mask="0x00F00000" name="PIXEL1718" />
            <bitfield mask="0x0F000000" name="PIXEL1717" />
            <bitfield mask="0xF0000000" name="PIXEL1716" />
         </register>
         <register caption="" name="GLCDCURDATA71" offset="0x91C" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1731" />
            <bitfield mask="0x000000F0" name="PIXEL1730" />
            <bitfield mask="0x00000F00" name="PIXEL1729" />
            <bitfield mask="0x0000F000" name="PIXEL1728" />
            <bitfield mask="0x000F0000" name="PIXEL1727" />
            <bitfield mask="0x00F00000" name="PIXEL1726" />
            <bitfield mask="0x0F000000" name="PIXEL1725" />
            <bitfield mask="0xF0000000" name="PIXEL1724" />
         </register>
         <register caption="" name="GLCDCURDATA72" offset="0x920" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL187" />
            <bitfield mask="0x000000F0" name="PIXEL186" />
            <bitfield mask="0x00000F00" name="PIXEL185" />
            <bitfield mask="0x0000F000" name="PIXEL184" />
            <bitfield mask="0x000F0000" name="PIXEL183" />
            <bitfield mask="0x00F00000" name="PIXEL182" />
            <bitfield mask="0x0F000000" name="PIXEL181" />
            <bitfield mask="0xF0000000" name="PIXEL180" />
         </register>
