Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/atdf/PIC32MZ2025DAB176.atdf
         <register caption="" name="USBE3CSR1" offset="0x134" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="RXMAXP" />
            <bitfield mask="0x0000F800" name="MULT" />
            <bitfield mask="0x00010000" name="RXPKTRDY" />
            <bitfield mask="0x00020000" name="FIFOFULL" />
            <bitfield mask="0x00040000" name="ERROR" />
            <bitfield mask="0x00080000" name="DERRNAKT" />
            <bitfield mask="0x00100000" name="FLUSH" />
            <bitfield mask="0x00200000" name="REQPKT" />
            <bitfield mask="0x00400000" name="RXSTALL" />
            <bitfield mask="0x00800000" name="CLRDT" />
            <bitfield mask="0x01000000" name="INCOMPRX" />
            <bitfield mask="0x02000000" name="DATATGGL" />
            <bitfield mask="0x04000000" name="DATATWEN" />
            <bitfield mask="0x08000000" name="DMAREQMD" />
            <bitfield mask="0x10000000" name="PIDERR" />
            <bitfield mask="0x20000000" name="DMAREQEN" />
            <bitfield mask="0x40000000" name="AUTORQ" />
            <bitfield mask="0x80000000" name="AUTOCLR" />
         </register>
         <register caption="" name="USBE3CSR2" offset="0x138" rw="RW" size="4">
            <bitfield mask="0x00003FFF" name="RXCNT" />
            <bitfield mask="0x000F0000" name="TEP" />
            <bitfield mask="0x00300000" name="PROTOCOL" />
            <bitfield mask="0x00C00000" name="SPEED" />
            <bitfield mask="0xFF000000" name="TXINTERV" />
         </register>
         <register caption="" name="USBE3CSR3" offset="0x13c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="TEP" />
            <bitfield mask="0x00000030" name="PROTOCOL" />
            <bitfield mask="0x000000C0" name="SPEED" />
            <bitfield mask="0x0000FF00" name="RXINTERV" />
            <bitfield mask="0x0F000000" name="TXFIFOSZ" />
            <bitfield mask="0xF0000000" name="RXFIFOSZ" />
         </register>
         <register caption="" name="USBE4CSR0" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="TXMAXP" />
            <bitfield mask="0x0000F800" name="MULT" />
            <bitfield mask="0x00010000" name="TXPKTRDY" />
            <bitfield mask="0x00020000" name="FIFONE" />
            <bitfield mask="0x00040000" name="ERROR" />
            <bitfield mask="0x00080000" name="FLUSH" />
            <bitfield mask="0x00100000" name="SETUPPKT" />
            <bitfield mask="0x00200000" name="RXSTALL" />
            <bitfield mask="0x00400000" name="CLRDT" />
            <bitfield mask="0x00800000" name="NAKTMOUT" />
            <bitfield mask="0x01000000" name="DATATGGL" />
            <bitfield mask="0x02000000" name="DTWREN" />
            <bitfield mask="0x04000000" name="DMAREQMD" />
            <bitfield mask="0x08000000" name="FRCDATTG" />
            <bitfield mask="0x10000000" name="DMAREQEN" />
            <bitfield mask="0x20000000" name="MODE" />
            <bitfield mask="0x80000000" name="AUTOSET" />
         </register>
         <register caption="" name="USBE4CSR1" offset="0x144" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="RXMAXP" />
            <bitfield mask="0x0000F800" name="MULT" />
            <bitfield mask="0x00010000" name="RXPKTRDY" />
            <bitfield mask="0x00020000" name="FIFOFULL" />
            <bitfield mask="0x00040000" name="ERROR" />
            <bitfield mask="0x00080000" name="DERRNAKT" />
            <bitfield mask="0x00100000" name="FLUSH" />
            <bitfield mask="0x00200000" name="REQPKT" />
            <bitfield mask="0x00400000" name="RXSTALL" />
            <bitfield mask="0x00800000" name="CLRDT" />
            <bitfield mask="0x01000000" name="INCOMPRX" />
            <bitfield mask="0x02000000" name="DATATGGL" />
            <bitfield mask="0x04000000" name="DATATWEN" />
            <bitfield mask="0x08000000" name="DMAREQMD" />
            <bitfield mask="0x10000000" name="PIDERR" />
            <bitfield mask="0x20000000" name="DMAREQEN" />
            <bitfield mask="0x40000000" name="AUTORQ" />
            <bitfield mask="0x80000000" name="AUTOCLR" />
         </register>
         <register caption="" name="USBE4CSR2" offset="0x148" rw="RW" size="4">
            <bitfield mask="0x00003FFF" name="RXCNT" />
            <bitfield mask="0x000F0000" name="TEP" />
            <bitfield mask="0x00300000" name="PROTOCOL" />
            <bitfield mask="0x00C00000" name="SPEED" />
            <bitfield mask="0xFF000000" name="TXINTERV" />
         </register>
         <register caption="" name="USBE4CSR3" offset="0x14c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="TEP" />
            <bitfield mask="0x00000030" name="PROTOCOL" />
            <bitfield mask="0x000000C0" name="SPEED" />
            <bitfield mask="0x0000FF00" name="RXINTERV" />
            <bitfield mask="0x0F000000" name="TXFIFOSZ" />
            <bitfield mask="0xF0000000" name="RXFIFOSZ" />
         </register>
         <register caption="" name="USBE5CSR0" offset="0x150" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="TXMAXP" />
            <bitfield mask="0x0000F800" name="MULT" />
            <bitfield mask="0x00010000" name="TXPKTRDY" />
            <bitfield mask="0x00020000" name="FIFONE" />
            <bitfield mask="0x00040000" name="ERROR" />
            <bitfield mask="0x00080000" name="FLUSH" />
            <bitfield mask="0x00100000" name="SETUPPKT" />
            <bitfield mask="0x00200000" name="RXSTALL" />
            <bitfield mask="0x00400000" name="CLRDT" />
            <bitfield mask="0x00800000" name="NAKTMOUT" />
            <bitfield mask="0x01000000" name="DATATGGL" />
            <bitfield mask="0x02000000" name="DTWREN" />
            <bitfield mask="0x04000000" name="DMAREQMD" />
            <bitfield mask="0x08000000" name="FRCDATTG" />
            <bitfield mask="0x10000000" name="DMAREQEN" />
            <bitfield mask="0x20000000" name="MODE" />
            <bitfield mask="0x80000000" name="AUTOSET" />
         </register>
         <register caption="" name="USBE5CSR1" offset="0x154" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="RXMAXP" />
            <bitfield mask="0x0000F800" name="MULT" />
            <bitfield mask="0x00010000" name="RXPKTRDY" />
            <bitfield mask="0x00020000" name="FIFOFULL" />
            <bitfield mask="0x00040000" name="ERROR" />
            <bitfield mask="0x00080000" name="DERRNAKT" />
            <bitfield mask="0x00100000" name="FLUSH" />
            <bitfield mask="0x00200000" name="REQPKT" />
            <bitfield mask="0x00400000" name="RXSTALL" />
            <bitfield mask="0x00800000" name="CLRDT" />
            <bitfield mask="0x01000000" name="INCOMPRX" />
            <bitfield mask="0x02000000" name="DATATGGL" />
            <bitfield mask="0x04000000" name="DATATWEN" />
            <bitfield mask="0x08000000" name="DMAREQMD" />
            <bitfield mask="0x10000000" name="PIDERR" />
            <bitfield mask="0x20000000" name="DMAREQEN" />
            <bitfield mask="0x40000000" name="AUTORQ" />
            <bitfield mask="0x80000000" name="AUTOCLR" />
         </register>
         <register caption="" name="USBE5CSR2" offset="0x158" rw="RW" size="4">
            <bitfield mask="0x00003FFF" name="RXCNT" />
            <bitfield mask="0x000F0000" name="TEP" />
            <bitfield mask="0x00300000" name="PROTOCOL" />
            <bitfield mask="0x00C00000" name="SPEED" />
            <bitfield mask="0xFF000000" name="TXINTERV" />
         </register>
